/*
 * @Author: wangzhongjie
 * @Date: 2020-12-22 15:25:41
 * @LastEditors: wangzhongjie
 * @LastEditTime: 2020-12-22 15:30:48
 * @Description: 上传文件
 * @Email: UvDream@163.com
 */
var client = require("scp2");
//console.log("开始自动上传!");
console.log(
  [
    "                   _ooOoo_",
    "                  o8888888o",
    '                  88" . "88',
    "                  (| -_- |)",
    "                  O\\  =  /O",
    "               ____/`---'\\____",
    "             .'  \\\\|     |//  `.",
    "            /  \\\\|||  :  |||//  \\",
    "           /  _||||| -:- |||||-  \\",
    "           |   | \\\\\\  -  /// |   |",
    "           | \\_|  ''\\---/''  |   |",
    "           \\  .-\\__  `-`  ___/-. /",
    "         ___`. .'  /--.--\\  `. . __",
    '      ."" \'<  `.___\\_<|>_/___.\'  >\'"".',
    "     | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |",
    "     \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /",
    "======`-.____`-.___\\_____/___.-`____.-'======",
    "                   `=---='",
    "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^",
    "         佛祖保佑       永无BUG"
  ].join("\n")
);
client.scp(
  "./dist/",
  {
    host: "115.159.56.185",
    port: "22",
    username: "root",
    password: "11165Wzj", 
    path: "/www/blog/Kyara/web"
  },
  err => {
    if (!err) {
      console.log("项目发布完毕!");
    } else {
      console.log("err", err);
    }
  }
);
